Tekla.Structures.ModelInternal.dotStringProperty_t
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotStringProperty_t.FatherId
ID of the object whose property we wish to get or set

Tekla.Structures.ModelInternal.dotStringProperty_t.aName
Name of the property

Tekla.Structures.ModelInternal.dotStringProperty_t.aValueString
Value of the property

Tekla.Structures.ModelInternal.dotStringProperty_t.ValueStringIteration
